OpenFOAM-11/tutorials/multiphaseEuler/wallBoilingPolydisperse/0/alphat.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 1e-08;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 1e-08;
    }
    wall
    {
        type            compressible::alphatWallBoilingWallFunction;
        otherPhase      gas;
        phaseType       liquid;
        Prt             0.85;
        partitioningModel
        {
            type            Lavieville;
            alphaCrit       0.2;
        }
        nucleationSiteModel
        {
            type            LemmertChawla;
            Cn              1;
            NRef            30000000;
            deltaTRef       10;
        }
        departureDiameterModel
        {
            type            TolubinskiKostanchuk;
            dRef            0.00024;
            dMax            0.0014;
            dMin            1e-06;
        }
        departureFrequencyModel
        {
            type            KocamustafaogullariIshii;
            Cf              1.18;
        }
        value           uniform 0.01;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
